01  WS-AREA. 
    05  WS-COUNT PIC 9(5) VALUE ZEROS. 
    05  WS-TABLE OCCURS 100 TIMES. 
       10  WS-ENTRY PIC X(82). 

PROCEDURE DIVISION. 
    PERFORM VARYING WS-COUNT FROM 1 BY 1 UNTIL WS-COUNT > 100 
       MOVE "RECORD" TO WS-ENTRY(WS-COUNT) 
       MOVE WS-COUNT TO WS-COUNT-TEMP 
       MOVE WS-COUNT-TEMP TO WS-ENTRY(WS-COUNT) 
    END-PERFORM. 

    DISPLAY "TABLE CONTENTS" 
    PERFORM VARYING WS-COUNT FROM 1 BY 1 UNTIL WS-COUNT > 100 
       DISPLAY WS-TABLE(WS-COUNT) 
    END-PERFORM.
    STOP RUN.

    01 WS-COUNT-TEMP PIC 9(5). 